Repository: opinsys/opinsys-debs
Catalog: packages/default/krb5/debian/po/*.po
Languages: pt_br

source: Setting up a Kerberos Realm
pt_br: Configurando um Realm Kerberos

source: This package contains the administrative tools required to run the Kerberos master server.
pt_br: Este pacote contém ferramentas administrativas necessárias para executar o servidor mestre Kerberos.

source: However, installing this package does not automatically set up a Kerberos realm. This can be done later by running the "krb5_newrealm" command.
pt_br: Contudo, instalar este pacote não configura automaticamente um realm Kerberos. Isto pode ser feito depois executando o comando "krb5_newrealm".

source: Please also read the /usr/share/doc/krb5-kdc/README.KDC file and the administration guide found in the krb5-doc package.
pt_br: Por favor, leia também o arquivo /usr/share/doc/krb5-kdc/README.KDC e o guia de administração encontrado no pacote krb5-doc.

source: Run the Kerberos V5 administration daemon (kadmind)?
pt_br: Executar o daemon de administração do Kerberos V5 (kadmind)?

source: Kadmind serves requests to add/modify/remove principals in the Kerberos database.
pt_br: O Kadmind serve pedidos de adicionar/modificar/remover principals na base de dados do Kerberos.

source: It is required by the kpasswd program, used to change passwords. With standard setups, this daemon should run on the master KDC.
pt_br: Ele é necessário para o programa kpasswd, usado para alterar senhas. Com configurações padrão, este daemon deve executar no mestre KDC.

source: Create the Kerberos KDC configuration automatically?
pt_br: Criar a configuração do Kerberos KDC automaticamente?

source: The Kerberos Domain Controller (KDC) configuration files, in /etc/krb5kdc, may be created automatically.
pt_br: Os arquivos de configuração do Controlador de Domínio Kerberos (KDC, em inglês), em /etc/krb5kdc, podem ser criados automaticamente.

source: By default, an example template will be copied into this directory with local parameters filled in.
pt_br: Por padrão, um modelo de exemplo será copiado para este diretório com os parâmetros locais preenchidos.

source: Administrators who already have infrastructure to manage their Kerberos configuration may wish to disable these automatic configuration changes.
pt_br: Administradores que já possuem infraestrutura para administrar suas configurações Kerberos podem desejar desabilitar estas mudanças de configuração automática.

source: Kerberos V4 compatibility mode to use:
pt_br: Modo de compatibilidade Kerberos V4 a ser utilizado:

source: By default, Kerberos V4 requests are allowed from principals that do not require preauthentication ("nopreauth"). This allows Kerberos V4 services to exist while requiring most users to use Kerberos V5 clients to get their initial tickets. These tickets can then be converted to Kerberos V4 tickets.
pt_br: Por padrão, requisições Kerberos V4 são permitidas de principals que não necessitem de pré-autenticação ("nopreauth"). Isso permite que serviços Kerberos V4 existam enquanto requer que a maioria dos usuários usem clientes Kerberos V5 para obter seus tickets iniciais. Esses tickets podem então ser convertidos para tickets Kerberos V4.

source: Alternatively, the mode can be set to "full", allowing Kerberos V4 clients to get initial tickets even when preauthentication would normally be required; to "disable", returning protocol version errors to all Kerberos V4 clients; or to "none", which tells the KDC to not respond to Kerberos V4 requests at all.
pt_br: Alternativamente, o modo pode ser configurado para "full", permitindo clientes Kerberos V4 obter tickets iniciais mesmo quando a pré-autenticação é normalmente necessária; para "disable", retornando erros de versão de protocolo para todos os clientes Kerberos V4, ou para "none", que informa o KDC para não responder a requisições Kerberos V4 de nenhuma forma.

source: Run a Kerberos V5 to Kerberos V4 ticket conversion daemon?
pt_br: Executar um daemon de conversão de tickets Kerberos V5 para Kerberos V4?

source: The krb524d daemon converts Kerberos V5 tickets into Kerberos V4 tickets for programs, such as krb524init, that obtain Kerberos V4 tickets for compatibility with old applications.
pt_br: O daemon krb524d converte tickets Kerberos V5 em tickets Kerberos V4 para programas, como o krb524init, que obtêm tickets Kerberos V4 para compatibilidade com aplicações antigas.

source: It is recommended to enable that daemon if Kerberos V4 is enabled, especially when Kerberos V4 compatibility is set to "nopreauth".
pt_br: É recomendado habilitar este daemon se o Kerberos V4 é habilitado, especialmente quando a compatibilidade do Kerberos V4 é configurada para "nopreauth".

source: Should the KDC database be deleted?
pt_br: O banco de dados do KDC deve ser removido?

source: By default, removing this package will not delete the KDC database in /var/lib/krb5kdc/principal since this database cannot be recovered once it is deleted.
pt_br: Por padrão, remover este pacote não irá remover o banco de dados do KDC em /var/lib/krb5kdc/principal visto que este banco de dados não pode ser recuperado uma vez removido.

source: Choose this option if you wish to delete the KDC database now, deleting all of the user accounts and passwords in the KDC.
pt_br: Escolha esta opção se você deseja remover o banco de dados do KDC agora, removendo todas as contas de usuários e senhas no KDC.
