Repository: opinsys/opinsys-debs
Catalog: ports/nbd/debian/po/*.po
Languages: es

source: AUTO_GEN is set to "n" in /etc/nbd-client
es: AUTO_GEN está establecido a «n» en «/etc/nbd-client»

source: The /etc/nbd-client file contains a line that sets the AUTO_GEN variable to "n". The file will therefore not be regenerated automatically.
es: El archivo «/etc/nbd-client» contiene una línea que establece la variable AUTO_GEN a «n». Por tanto, el archivo no se regenerará automáticamente.

source: If that's wrong, remove the line and call "dpkg-reconfigure nbd-client" afterwards.
es: Si no es correcto, elimine esa línea y ejecute «dpkg-reconfigure nbd-client» después.

source: Number of nbd-client connections to use:
es: Número de conexiones que ndb-client va a utilizar:

source: nbd-client can handle multiple concurrent connections. Please specify the number of connections you'd like this configuration script to set up.
es: nbd-client puede gestionar varias conexiones concurrentes. Por favor, especifique el número de conexiones que le gustaría configurar mediante este script.

source: Note that if something has already been specified in /etc/nbd-client, the current configuration will be used as defaults in these dialogs.
es: Tenga en cuenta que si ya se ha especificado algo en «/etc/nbd-client», se utilizará la configuración actual como predeterminada en estos diálogos.

source: swap, filesystem, raw
es: intercambio, sistema de archivos, en bruto

source: Intended use of the network block device number ${number}:
es: Tipo de uso para el dispositivo de bloques en red número ${number}:

source: The network block device can serve multiple purposes. One of the most interesting is to provide swap space over the network for diskless clients, but you can store a filesystem on it, or do other things with it for which a block device is interesting.
es: Un dispositivo de bloques en red puede servir para varios propósitos. Uno de los más interesantes es el de proporcionar un espacio de intercambio a través de la red para clientes ligeros (sin disco duro), pero sobre los que puede almacenar un sistema de archivos así como para hacer otras cosas para las cuales un dispositivos de bloques puede resultar interesante.

source: If you intend to use the network block device as a swap device, choose "swap". If you intend to use it as a filesystem, add a line to /etc/fstab, give it the option "_netdev" (else init will try to mount it before it's usable), and choose "filesystem". For all other purposes, choose "raw". The only thing the nbd-client boot script will do then is start an nbd-client process; you will have to set it up manually.
es: Si quiere utilizar un dispositivo de bloques en red como dispositivo de intercambio, seleccione «intercambio». Si quiere usarlo como sistema de archivos, añada una línea en «/etc/fstab», incluya la opción «_netdev» (de lo contrario init intentará montarlo antes de que se pueda utilizar) y seleccione «sistema de archivos». Para cualquier otro propósito, seleccione «en bruto». Lo único que hará el script de inicio de nbd-client es ejecutar nbd-client por lo que tendrá que configurarlo de forma manual.

source: Hostname of the server (number: ${number})?
es: ¿Cuál es el nombre del servidor (número: ${number})?

source: Please enter the network name or IP address of the machine on which the nbd-server process is running.
es: Por favor, introduzca el nombre de la red o la dirección IP del equipo donde se está ejecutando el proceso nbd-server.

source: Port or name for nbd export (number: ${number})?
es: ¿Cuál es el puerto o el nombre para la exportación nbd (número: ${number})?

source: Please enter the TCP port number or NBD export name needed to access nbd-server.
es: Por favor, introduzca el número del puerto TCP o el nombre de exportación NBD que se necesita para acceder a nbd-server.

source: Versions of nbd-server of 2.9.16 or lower did not support specifying a name for the NBD export. If your NBD server is of an older version, you should enter the TCP port number here, and should make sure not to enter any non-numeric characters in the field.
es: Las versiones 2.9.16 (o anteriores) de nbd-server no permitían especificar un nombre para la exportación de NBD. Si su servidor NBD es de una versión antigua, debe introducir aquí el número del puerto TCP así como asegurarse de introducir sólo caracteres numéricos en este campo.

source: More recent versions of nbd-server support providing a name for an export. If the data entered in this field contains any non-numeric characters, then this configuration system will accept that as a name and provide it to nbd-client as a name-based export rather than a port-based one.
es: Las versiones más recientes de nbd-server permiten proporcionar un nombre para la exportación. Si los datos introducidos en este campo contienen caracteres no numéricos, el sistema de configuración lo aceptará como un nombre y se lo proporcionará a nbd-client como una exportación basada en nombre en lugar de una exportación basada en puerto.

source: /dev entry for this nbd-client (number: ${number})?
es: ¿Cuál es la entrada en «/dev» para este nbd-client (número: ${number})?

source: Every nbd-client process needs to be associated with a /dev entry with major number 43. Please enter the name of the /dev entry you want to use for this nbd-client. Note that this needs to be the full path to that entry, not just the last part.
es: Cada proceso nbd-client necesita asociarse con una entrada en «/dev» que tenga un número principal de 43. Por favor, introduzca el nombre de la entrada en «/dev» que desea utilizar con este nbd-client. Tenga en cuenta que necesita especificar la ruta completa, no sólo la última parte.

source: If the /dev entry specified does not exist, it will be created with minor number ${number}.
es: Si la entrada especificada en «/dev» no existe, se creará con el número menor ${number}.

source: Disconnect all NBD devices on "stop"?
es: ¿Desea desconectar todos los dispositivos NBD al «detener»?

source: When the nbd-client init script is called to stop the nbd-client service, there are two things that can be done: either it can disconnect all nbd-client devices (which are assumed not to be in use), or it can disconnect only those nbd-client devices that it knows about in its config file.
es: Cuando se ejecuta el script de inicio de nbd-client para detener el servicio nbd-client, se puede hacer dos cosas: desconectar todos los dispositivos nbd-client (se asume que no están en uso), o se puede desconectar solamente los dispositivos nbd-client reconocidos por el archivo de configuración.

source: The default (and the traditional behavior) is to disconnect all nbd-client devices. If the root device or other critical file systems are on NBD this will cause data loss and should not be accepted.
es: La opción predeterminada (y el comportamiento tradicional) es desconectar todos los dispositivos nbd-client. Si el dispositivo raíz o cualquier otro sistema de archivos crítico se encuentran en NBD esto causará una pérdida de datos, lo cual no debería ser aceptable.

source: Extra parameters (number: ${number})
es: Parámetros adicionales (número: ${number})

source: If you wish to add any extra parameters to nbd-client, then please enter them here.
es: Si quiere añadir parámetros adicionales a nbd-client, puede introducirlos aquí.

source: Number of nbd-server instances to run:
es: Número de instancias de nbd-server a ejecutar:

source: Multiple nbd-server processes may run to export multiple files or block devices. Please specify how many configurations for such servers you want to generate.
es: Se pueden ejecutar varios procesos nbd-server para exportar múltiples archivos o dispositivos de bloques. Por favor, especifique cuántas configuraciones desea generar para esos servidores.

source: Note that you can always add extra servers by adding them to /etc/nbd-server/config, or by running "dpkg-reconfigure nbd-server".
es: Tenga en cuenta que siempre podrá incluir servidores adicionales añadiéndolos en «/etc/nbd-server/config» o ejecutando «dpkg-reconfigure nbd-server».

source: TCP Port for server number ${number}:
es: Puerto TCP para el servidor número ${number}:

source: Please specify the TCP port this instance of nbd server will use for backwards compatibility with older clients.
es: Por favor, especifique el puerto TCP que esta instancia del servidor nbd utilizará a modo de compatibilidad con versiones anteriores del cliente.

source: Name of export ${number}:
es: Nombre de la exportación ${number}:

source: Please specify a name for this export.
es: Por favor, especifique un nombre para esta exportación.

source: File to export (server number ${number}):
es: Archivo a exportar (número de servidor ${number}):

source: Please specify a file name or block device that should be exported over the network. You can export a real block device (for instance "/dev/hda1"); a normal file (such as "/export/nbd/bl1"); or a bunch of files all at once. For the third option, you can use "%s" in the filename, which will be expanded to the IP-address of the connecting client. An example would be "/export/swaps/swp%s".
es: Por favor, especifique un nombre de archivo o un dispositivo de bloques para exportar a través de la red. Puede exportar un dispositivo de bloques real (por ejemplo «/dev/hda1»), un archivo común (como «/export/nbd/bl1»), o un conjunto de archivos al mismo tiempo. Para la tercera opción, puede utilizar «%s» en el nombre del archivo, que se sustituirá con la dirección IP del cliente que se conecta. Un ejemplo sería «/export/swaps/swp%s».

source: Note that it is possible to tune the way in which the IP address will be substituted in the file name. See "man 5 nbd-server" for details.
es: Tenga en cuenta que es posible afinar la forma en la que se sustituirá la dirección IP en el nombre del archivo. Consulte «man 5 nbd-server» para obtener más información.

source: AUTO_GEN is set to "n" in /etc/nbd-server
es: AUTO_GEN está establecido a «n» en «/etc/nbd-server»

source: The /etc/nbd-server file contains a line that sets the AUTO_GEN variable to "n". The file will therefore not be regenerated automatically.
es: El archivo «/etc/nbd-server» contiene una línea que establece la variable AUTO_GEN a «n». Por tanto, el archivo no se regenerará automáticamente.

source: Note that the current version of the nbd-server package no longer uses /etc/nbd-server. Instead it uses a new configuration file, read by nbd-server itself (rather than the init script), which supports more options. See "man 5 nbd-server" for details.
es: Tenga en cuenta que la versión actual del paquete nbd-server ya no utiliza «/etc/nbd-server». En su lugar utiliza un nuevo archivo de configuración que lee el propio nbd-server (en lugar del script de inicio) y que admite más opciones. Consulte «man 5 nbd-server» para obtener más información.

source: If you remove or comment out the AUTO_GEN line, a file /etc/nbd-server/config in the new format may be generated based on the current configuration. Until then, the nbd-server installation will be broken.
es: Si elimina o comenta la línea AUTO_GEN, se puede crear un archivo «/etc/nbd-server/config» basado en la configuración actual usando el nuevo formato. Mientras tanto, la instalación de nbd-server permanecerá rota.

source: Convert old-style nbd-server configuration file?
es: ¿Desea convertir el archivo de configuración antiguo de nbd-server?

source: A pre-2.9 nbd-server configuration file has been found on this system. The current nbd-server package no longer supports this file and will not work if it is kept as is.
es: Se ha encontrado un archivo de configuración anterior a la versión 2.9 de nbd-server en este sistema. El paquete actual de nbd-server ya no admite este archivo y no funcionará si lo mantiene como está.

source: If you choose this option, the system will generate a new style configuration file based upon the old-style configuration file, which will be removed. Otherwise, configuration questions will be asked and the system will generate a new configuration file.
es: Si selecciona esta opción, el sistema generará un archivo de configuración con el nuevo estilo basado en el archivo de configuración antiguo, el cual se eliminará. De lo contrario, se le harán varias preguntas sobre la configuración y el sistema generará un nuevo archivo de configuración.

source: If a new-style configuration file already exists and you choose this option, you will shortly see a "modified configuration file" prompt, as usual.
es: Si ya existe un archivo de configuración que utilice el nuevo estilo y selecciona esta opción, aparecerá en breve un aviso de «archivo de configuración modificado», como es habitual.

source: Support port-based exports?
es: ¿Desea permitir exportaciones basadas en puertos?

source: Since version 2.9.18, nbd-server supports name-based exports, rather than port-based ones. While this is generally preferable, you may have to support systems running an older version of nbd-client, or might need to go through a lot of trouble to update your older configurations in order to migrate to name-based exports. In either of those cases, you should accept this option.
es: Desde la versión 2.9.18, nbd-server permite exportaciones basadas en nombres en lugar de exportaciones basadas en puertos. Aunque esta opción suele ser preferible, es posible que tenga que mantener sistemas con versiones antiguas de nbd-client o que pueda tener muchos problemas para actualizar las configuraciones antiguas y migrarlas a exportaciones basadas en nombres. En cualquiera de estos casos, debería aceptar esta opción.

source: Everyone else should leave the option at the default setting, which will cause nbd-server to only support name-based exports.
es: Para el resto de situaciones, debería mantener la opción con el ajuste predeterminado, lo cual hará que nbd-server sólo admita exportaciones basadas en nombres.
