Repository: opinsys/opinsys-debs
Catalog: packages/nbd/debian/po/*.po
Languages: nl

source: AUTO_GEN is set to "n" in /etc/nbd-client
nl: /etc/nbd-client heeft AUTO_GEN op "n" staan

source: The /etc/nbd-client file contains a line that sets the AUTO_GEN variable to "n". The file will therefore not be regenerated automatically.
nl: Het bestand /etc/nbd-client bevat een regel die de variabele 'AUTO_GEN' op "n" zet. Het bestand zal daarom niet automatisch geregenereerd worden.

source: If that's wrong, remove the line and call "dpkg-reconfigure nbd-client" afterwards.
nl: Als dat onjuist is, verwijder dan deze regel en roep later "dpkg-reconfigure nbd-client" aan.

source: Number of nbd-client connections to use:
nl: Aantal te gebruiken nbd-client-verbindingen:

source: nbd-client can handle multiple concurrent connections. Please specify the number of connections you'd like this configuration script to set up.
nl: nbd-client kan verscheidene verbindingen tegelijkertijd afhandelen. Hoeveel verbindingen moet dit configuratiescript instellen?

source: Note that if something has already been specified in /etc/nbd-client, the current configuration will be used as defaults in these dialogs.
nl: Merk op dat indien /etc/nbd-client reeds informatie bevat, dat dan de huidige configuratie gebruikt zal worden voor de standaardwaarden in deze dialogen.

source: swap, filesystem, raw
nl: swap, bestandssysteem, geen configuratie

source: Intended use of the network block device number ${number}:
nl: Gebruik van netwerkblokapparaat nummer ${number}:

source: The network block device can serve multiple purposes. One of the most interesting is to provide swap space over the network for diskless clients, but you can store a filesystem on it, or do other things with it for which a block device is interesting.
nl: Het netwerkblokapparaat kan voor verschillende doelen gebruikt worden. EÃ©n van de meest interessante is om swapruimte via het netwerk aan te bieden aan computers zonder harde schijf, maar u kunt er ook een bestandssysteem op plaatsen, of er andere zaken mee doen waar een blokapparaatbestand interessant voor kan zijn.

source: If you intend to use the network block device as a swap device, choose "swap". If you intend to use it as a filesystem, add a line to /etc/fstab, give it the option "_netdev" (else init will try to mount it before it's usable), and choose "filesystem". For all other purposes, choose "raw". The only thing the nbd-client boot script will do then is start an nbd-client process; you will have to set it up manually.
nl: Als u van plan bent om het als swapapparaat te gebruiken, kies dan "swap". Bent u van plan om dit als bestandssysteem te gebruiken, voeg dan een regel toe aan /etc/fstab, geef het de optie "_netdev" (als u dat niet doet dan zal init proberen het bestandssysteem aan te koppelen voordat deze bruikbaar is), en kies "bestandssysteem". Voor alle andere doelen kiest u "geen configuratie". Het enige dat het nbd-client opstartscript dan zal doen is het starten van een nbd-client proces; u zult alle andere zaken handmatig moeten instellen.

source: Hostname of the server (number: ${number})?
nl: Computernaam van de server (nummer: ${number})?

source: Please enter the network name or IP address of the machine on which the nbd-server process is running.
nl: Gelieve de netwerknaam of het IP-adres van de machine waarop de nbd-server draait, in te geven.

source: Port or name for nbd export (number: ${number})?
nl: Poort of naam van de nbd-export (nummer: ${number})?

source: Please enter the TCP port number or NBD export name needed to access nbd-server.
nl: Gelieve het TCP-poortnummer of the NBD-exportnaam om nbd-server te benaderen, in te geven.

source: Versions of nbd-server of 2.9.16 or lower did not support specifying a name for the NBD export. If your NBD server is of an older version, you should enter the TCP port number here, and should make sure not to enter any non-numeric characters in the field.
nl: nbd-server versie 2.9.16 of lager ondersteunden geen NBD-export op basis van een naam. Als uw NBD-server van zo'n oude versie is dient u hier het TCP-poortnummer op te geven en er op te letten dat u geen niet-numerieke tekens invoert.

source: More recent versions of nbd-server support providing a name for an export. If the data entered in this field contains any non-numeric characters, then this configuration system will accept that as a name and provide it to nbd-client as a name-based export rather than a port-based one.
nl: Nieuwer versies van nbd-server ondersteunen het gebruik van een naam voor een export. Als dit veld niet-numerieke tekens bevat dan zal dit configuratiesysteem het als een naam accepteren en het aanbieden aan nbd-client als een op naam gebaseerde export in plaats van een op poort gebaseerde.

source: /dev entry for this nbd-client (number: ${number})?
nl: /dev-ingang voor deze nbd-client (nummer: ${nummer})?

source: Every nbd-client process needs to be associated with a /dev entry with major number 43. Please enter the name of the /dev entry you want to use for this nbd-client. Note that this needs to be the full path to that entry, not just the last part.
nl: Elk nbd-client-proces moet geassocieerd worden met een /dev ingang met major nummer 43. Gelieve de naam van de /dev-ingang op te geven die u wilt gebruiken voor deze nbd-client. Merk op dat hier het volledige pad naar die ingang bedoeld wordt, en niet slechts het laatste deel.

source: If the /dev entry specified does not exist, it will be created with minor number ${number}.
nl: Wanneer deze ingang nog niet bestaat, zal hij aangemaakt worden met minor nummer ${number}

source: Disconnect all NBD devices on "stop"?
nl: Alle NBD-apparaten afsluiten bij "stop"?

source: When the nbd-client init script is called to stop the nbd-client service, there are two things that can be done: either it can disconnect all nbd-client devices (which are assumed not to be in use), or it can disconnect only those nbd-client devices that it knows about in its config file.
nl: Wanneer het nbd-client initscript uitgevoerd wordt om de nbd-client service te stoppen, zijn er twee dingen die gedaan kunnen worden: ofwel kan het script alle nbd-client apparaten stoppen (waarbij er vanuit gegaan wordt dat ze niet in gebruik zijn), ofwel kan het enkel die apparaten stoppen waarvan het weet heeft via de configuratie.

source: The default (and the traditional behavior) is to disconnect all nbd-client devices. If the root device or other critical file systems are on NBD this will cause data loss and should not be accepted.
nl: Het standaard (en historisch) gedrag is om alle nbd-client verbindingen te verbreken. Als het root-apparaat of een ander kritiek bestandssysteem zich op een NBD bevindt, dan zal dit verlies van gegevens tot gevolg hebben en dus moet deze optie dan niet geaccepteerd worden.

source: Extra parameters (number: ${number})
nl: Extra opties (nummer: ${number})?

source: If you wish to add any extra parameters to nbd-client, then please enter them here.
nl: Indien u extra opties aan nbd-client wenst mee te geven, gelieve ze dan hier op te geven.

source: Number of nbd-server instances to run:
nl: Aantal te draaien nbd-server-instanties:

source: Multiple nbd-server processes may run to export multiple files or block devices. Please specify how many configurations for such servers you want to generate.
nl: U kunt verschillende nbd-server-processen uitvoeren, om verschillende bestanden of blokapparaten te exporteren. Gelieve op te geven hoeveel nbd-server-configuraties u dit configuratiescript wilt laten aanmaken.

source: Note that you can always add extra servers by adding them to /etc/nbd-server/config, or by running "dpkg-reconfigure nbd-server".
nl: Merk op dat u altijd extra servers kunt toevoegen door ze aan het bestand /etc/nbd-server/config toe te voegen, of door "dpkg-reconfigure nbd-server" uit te voeren.

source: TCP Port for server number ${number}:
nl: TCP-poort voor de server nummer ${number}:

source: Please specify the TCP port this instance of nbd server will use for backwards compatibility with older clients.
nl: Welke TCP-poort moet deze instantie van nbd-server gebruiken voor de ondersteuning van oudere clients?

source: Name of export ${number}:
nl: Naam van export ${number}:

source: Please specify a name for this export.
nl: Wat is naam voor deze export?

source: File to export (server number ${number}):
nl: Te exporteren bestand (server nummer: ${number})?

source: Please specify a file name or block device that should be exported over the network. You can export a real block device (for instance "/dev/hda1"); a normal file (such as "/export/nbd/bl1"); or a bunch of files all at once. For the third option, you can use "%s" in the filename, which will be expanded to the IP-address of the connecting client. An example would be "/export/swaps/swp%s".
nl: U dient hier een bestandsnaam op te geven geven van een bestand of apparaatbestand welke u via het netwerk wilt exporteren. U kunt ofwel een echt apparaatbestand exporteren (b.v. "/dev/hda1"), een normaal bestand exporteren (b.v. "/export/nbd/bl1"), of een hoop bestanden in Ã©Ã©n keer; voor de laatste optie kunt u "%s" in de bestandnaam gebruiken, wat dan vervangen zal worden door het IP-adres van de client die probeert te verbinden. Een mogelijk voorbeeld is "/export/swaps/swp%s".

source: Note that it is possible to tune the way in which the IP address will be substituted in the file name. See "man 5 nbd-server" for details.
nl: Merk op dat het mogelijk is om de wijze waarop het IP-adres vervangen wordt in de bestandsnaam, aan te passen. Zie "man 5 nbd-server" voor details.

source: AUTO_GEN is set to "n" in /etc/nbd-server
nl: AUTO_GEN staat op "n" in /etc/nbd-server

source: The /etc/nbd-server file contains a line that sets the AUTO_GEN variable to "n". The file will therefore not be regenerated automatically.
nl: Het bestand /etc/nbd-server bevat een regel dat de AUTO_GEN variabele op "n" zet. Dit bestand zal daarom niet automatisch geregenereerd worden.

source: Note that the current version of the nbd-server package no longer uses /etc/nbd-server. Instead it uses a new configuration file, read by nbd-server itself (rather than the init script), which supports more options. See "man 5 nbd-server" for details.
nl: Merk op dat de huidige versie van het nbd-server pakket het bestand /etc/nbd-server niet langer ondersteunt. In de plaats daarvan gebruikt het een nieuwe stijl van configuratiebestand dat gelezen wordt door nbd-server zelf (in plaats van het init-script), en dat meer mogelijkheden heeft. Zie "man 5 nbd-server" voor details.

source: If you remove or comment out the AUTO_GEN line, a file /etc/nbd-server/config in the new format may be generated based on the current configuration. Until then, the nbd-server installation will be broken.
nl: Als u de AUTO_GEN-regel verwijdert of uitcommentarieert, dan kan een bestand /etc/nbd-server/config gegenereerd worden gebaseerd op uw huidige configuratie. Tot dan zal uw nbd-server installatie niet werken.

source: Convert old-style nbd-server configuration file?
nl: Het oude-stijl nbd-server configuratiebestand converteren?

source: A pre-2.9 nbd-server configuration file has been found on this system. The current nbd-server package no longer supports this file and will not work if it is kept as is.
nl: Een configuratiebestand voor nbd-server van voor versie 2.9 werd op dit systeem gevonden. De huidige versie van het nbd-server pakket ondersteunt dit bestand niet meer en zal zonder wijzigingen niet werken.

source: If you choose this option, the system will generate a new style configuration file based upon the old-style configuration file, which will be removed. Otherwise, configuration questions will be asked and the system will generate a new configuration file.
nl: Indien u deze optie accepteert, dan zal het systeem een nieuwe-stijl configuratiebestand aanmaken gebaseerd op het oude-stijl configuratiebestand, dat vervolgens verwijderd zal worden. In het andere geval zullen configuratievragen gesteld worden en zal het systeem een nieuw configuratiebestand genereren.

source: If a new-style configuration file already exists and you choose this option, you will shortly see a "modified configuration file" prompt, as usual.
nl: Als u reeds een nieuwe-stijl configuratiebestand hebt en u accepteert deze optie, dan zal u zo dadelijk een "gewijzigd configuratiebestand"-prompt zien, zoals gewoonlijk.

source: Support port-based exports?
nl: Op poort gebaseerde exports ondersteunen?

source: Since version 2.9.18, nbd-server supports name-based exports, rather than port-based ones. While this is generally preferable, you may have to support systems running an older version of nbd-client, or might need to go through a lot of trouble to update your older configurations in order to migrate to name-based exports. In either of those cases, you should accept this option.
nl: Sinds versie 2.9.18 ondersteunt nbd-server op naam gebaseerde exports, in plaats van op poort gebaseerde. Hoewel dit meestal de voorkeur geniet, moet u mogelijk systemen ondersteunen met een oudere versie van nbd-client, of is het voor u heel veel moeite om uw oude configuraties om te zetten naar op naam gebaseerde exports. In deze gevallen dient u deze optie te accepteren.

source: Everyone else should leave the option at the default setting, which will cause nbd-server to only support name-based exports.
nl: Als dit niet het geval is dient u deze optie op de standaardwaarde te laten staan, waardoor nbd-server alleen op naam gebaseerde exports zal ondersteunen.
